Nocterra-Consulting/MegaCore/avr/boards.txt
###########################################################################################################
## This file is created by MCUdude for use with MegaCore                                                 ##
## https://github.com/MCUdude/MegaCore                                                                   ##
##                                                                                                       ##
## This is the file where fuse settings, clock frequencies, upload ports, bootloaders and                ##
## compiler flags are located.                                                                           ##
##                                                                                                       ##
###########################################################################################################

# Menu options
menu.clock=Clock
menu.BOD=BOD
menu.eeprom=EEPROM
menu.LTO=Compiler LTO
menu.variant=Variant
menu.pinout=Pinout
menu.bootloader=Bootloader
menu.baudrate=Baud rate

#####################
#### ATmega2561  ####
#####################

# General
2561.name=ATmega2561
2561.upload.tool=avrdude
2561.upload.maximum_data_size=8192
2561.bootloader.tool=avrdude
2561.bootloader.unlock_bits=0xff
2561.bootloader.lock_bits=0xff
2561.build.core=MCUdude_corefiles
2561.build.variant=64-pin-avr
2561.build.board=AVR_ATmega2561
2561.build.mcu=atmega2561
2561.build.bootloader_led=led+b5
2561.build.extra_flags={build.clkpr}

# Upload port select
2561.menu.bootloader.uart0=Yes (UART0)
2561.menu.bootloader.uart0.upload.maximum_size=261632
2561.menu.bootloader.uart0.upload.protocol=urclock
2561.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
2561.menu.bootloader.uart0.build.export_merged_output=true
2561.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

2561.menu.bootloader.uart1=Yes (UART1)
2561.menu.bootloader.uart1.upload.maximum_size=261632
2561.menu.bootloader.uart1.upload.protocol=urclock
2561.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
2561.menu.bootloader.uart1.build.export_merged_output=true
2561.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

2561.menu.bootloader.no_bootloader=No bootloader
2561.menu.bootloader.no_bootloader.upload.maximum_size=262144
2561.menu.bootloader.no_bootloader.build.export_merged_output=false
2561.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
2561.menu.eeprom.keep=EEPROM retained
2561.menu.eeprom.keep.bootloader.high_fuses=0xd7
2561.menu.eeprom.erase=EEPROM not retained
2561.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
2561.menu.baudrate.default=Default
2561.menu.baudrate.default.upload.speed={upload.default_speed}
2561.menu.baudrate.1000000=1000000
2561.menu.baudrate.1000000.upload.speed=1000000
2561.menu.baudrate.500000=500000
2561.menu.baudrate.500000.upload.speed=500000
2561.menu.baudrate.460800=460800
2561.menu.baudrate.460800.upload.speed=460800
2561.menu.baudrate.250000=250000
2561.menu.baudrate.250000.upload.speed=250000
2561.menu.baudrate.230400=230400
2561.menu.baudrate.230400.upload.speed=230400
2561.menu.baudrate.125000=125000
2561.menu.baudrate.125000.upload.speed=125000
2561.menu.baudrate.115200=115200
2561.menu.baudrate.115200.upload.speed=115200
2561.menu.baudrate.57600=57600
2561.menu.baudrate.57600.upload.speed=57600
2561.menu.baudrate.38400=38400
2561.menu.baudrate.38400.upload.speed=38400
2561.menu.baudrate.19200=19200
2561.menu.baudrate.19200.upload.speed=19200
2561.menu.baudrate.9600=9600
2561.menu.baudrate.9600.upload.speed=9600
2561.menu.baudrate.4800=4800
2561.menu.baudrate.4800.upload.speed=4800

# Brown out detection
2561.menu.BOD.2v7=BOD 2.7V
2561.menu.BOD.2v7.bootloader.extended_fuses=0xfd
2561.menu.BOD.4v3=BOD 4.3V
2561.menu.BOD.4v3.bootloader.extended_fuses=0xfc
2561.menu.BOD.1v8=BOD 1.8V
2561.menu.BOD.1v8.bootloader.extended_fuses=0xfe
2561.menu.BOD.disabled=BOD disabled
2561.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
2561.menu.LTO.Os_flto=LTO enabled
2561.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
2561.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
2561.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
2561.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

2561.menu.LTO.Os=LTO disabled
2561.menu.LTO.Os.compiler.c.extra_flags=
2561.menu.LTO.Os.compiler.c.elf.extra_flags=
2561.menu.LTO.Os.compiler.cpp.extra_flags=
2561.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
2561.menu.clock.16MHz_external=External 16 MHz
2561.menu.clock.16MHz_external.upload.default_speed=115200
2561.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.16MHz_external.build.clkpr=
2561.menu.clock.16MHz_external.build.f_cpu=16000000L

2561.menu.clock.20MHz_external=External 20 MHz
2561.menu.clock.20MHz_external.upload.default_speed=115200
2561.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.20MHz_external.build.clkpr=
2561.menu.clock.20MHz_external.build.f_cpu=20000000L

2561.menu.clock.18_432MHz_external=External 18.4320 MHz
2561.menu.clock.18_432MHz_external.upload.default_speed=115200
2561.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.18_432MHz_external.build.clkpr=
2561.menu.clock.18_432MHz_external.build.f_cpu=18432000L

2561.menu.clock.14_7456MHz_external=External 14.7456 MHz
2561.menu.clock.14_7456MHz_external.upload.default_speed=115200
2561.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.14_7456MHz_external.build.clkpr=
2561.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

2561.menu.clock.12MHz_external=External 12 MHz
2561.menu.clock.12MHz_external.upload.default_speed=57600
2561.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.12MHz_external.build.clkpr=
2561.menu.clock.12MHz_external.build.f_cpu=12000000L

2561.menu.clock.11_0592MHz_external=External 11.0592 MHz
2561.menu.clock.11_0592MHz_external.upload.default_speed=115200
2561.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.11_0592MHz_external.build.clkpr=
2561.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

2561.menu.clock.8MHz_external=External 8 MHz
2561.menu.clock.8MHz_external.upload.default_speed=57600
2561.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.8MHz_external.build.clkpr=
2561.menu.clock.8MHz_external.build.f_cpu=8000000L

