Nocterra-Consulting/MegaCore/avr/boards.txt
# Clock frequencies
2560.menu.clock.16MHz_external=External 16 MHz
2560.menu.clock.16MHz_external.upload.default_speed=115200
2560.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.16MHz_external.build.clkpr=
2560.menu.clock.16MHz_external.build.oscillator=external_oscillator
2560.menu.clock.16MHz_external.build.clock_speed=16000000_hz
2560.menu.clock.16MHz_external.build.f_cpu=16000000L

2560.menu.clock.20MHz_external=External 20 MHz
2560.menu.clock.20MHz_external.upload.default_speed=115200
2560.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.20MHz_external.build.clkpr=
2560.menu.clock.20MHz_external.build.oscillator=external_oscillator
2560.menu.clock.20MHz_external.build.clock_speed=20000000_hz
2560.menu.clock.20MHz_external.build.f_cpu=20000000L

2560.menu.clock.18_432MHz_external=External 18.4320 MHz
2560.menu.clock.18_432MHz_external.upload.default_speed=115200
2560.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.18_432MHz_external.build.clkpr=
2560.menu.clock.18_432MHz_external.build.oscillator=external_oscillator
2560.menu.clock.18_432MHz_external.build.clock_speed=18432000_hz
2560.menu.clock.18_432MHz_external.build.f_cpu=18432000L

2560.menu.clock.14_7456MHz_external=External 14.7456 MHz
2560.menu.clock.14_7456MHz_external.upload.default_speed=115200
2560.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.14_7456MHz_external.build.clkpr=
2560.menu.clock.14_7456MHz_external.build.oscillator=external_oscillator
2560.menu.clock.14_7456MHz_external.build.clock_speed=14745600_hz
2560.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

2560.menu.clock.12MHz_external=External 12 MHz
2560.menu.clock.12MHz_external.upload.default_speed=57600
2560.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.12MHz_external.build.clkpr=
2560.menu.clock.12MHz_external.build.oscillator=external_oscillator
2560.menu.clock.12MHz_external.build.clock_speed=12000000_hz
2560.menu.clock.12MHz_external.build.f_cpu=12000000L

2560.menu.clock.11_0592MHz_external=External 11.0592 MHz
2560.menu.clock.11_0592MHz_external.upload.default_speed=115200
2560.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.11_0592MHz_external.build.clkpr=
2560.menu.clock.11_0592MHz_external.build.oscillator=external_oscillator
2560.menu.clock.11_0592MHz_external.build.clock_speed=11059200_hz
2560.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

2560.menu.clock.8MHz_external=External 8 MHz
2560.menu.clock.8MHz_external.upload.default_speed=57600
2560.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.8MHz_external.build.clkpr=
2560.menu.clock.8MHz_external.build.oscillator=external_oscillator
2560.menu.clock.8MHz_external.build.clock_speed=8000000L_hz
2560.menu.clock.8MHz_external.build.f_cpu=8000000L

2560.menu.clock.7_3728MHz_external=External 7.3728 MHz
2560.menu.clock.7_3728MHz_external.upload.default_speed=115200
2560.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.7_3728MHz_external.build.clkpr=
2560.menu.clock.7_3728MHz_external.build.oscillator=external_oscillator
2560.menu.clock.7_3728MHz_external.build.clock_speed=7372800_hz
2560.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

2560.menu.clock.6MHz_external=External 6 MHz
2560.menu.clock.6MHz_external.upload.default_speed=57600
2560.menu.clock.6MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.6MHz_external.build.clkpr=
2560.menu.clock.6MHz_external.build.oscillator=external_oscillator
2560.menu.clock.6MHz_external.build.clock_speed=6000000_hz
2560.menu.clock.6MHz_external.build.f_cpu=6000000L

2560.menu.clock.4MHz_external=External 4 MHz
2560.menu.clock.4MHz_external.upload.default_speed=9600
2560.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.4MHz_external.build.clkpr=
2560.menu.clock.4MHz_external.build.oscillator=external_oscillator
2560.menu.clock.4MHz_external.build.clock_speed=4000000_hz
2560.menu.clock.4MHz_external.build.f_cpu=4000000L

2560.menu.clock.3_6864MHz_external=External 3.6864 MHz
2560.menu.clock.3_6864MHz_external.upload.default_speed=115200
2560.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.3_6864MHz_external.build.clkpr=
2560.menu.clock.3_6864MHz_external.build.oscillator=external_oscillator
2560.menu.clock.3_6864MHz_external.build.clock_speed=3686400_hz
2560.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

2560.menu.clock.2MHz_external=External 2 MHz
2560.menu.clock.2MHz_external.upload.default_speed=9600
2560.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.2MHz_external.build.clkpr=
2560.menu.clock.2MHz_external.build.oscillator=external_oscillator
2560.menu.clock.2MHz_external.build.clock_speed=2000000_hz
2560.menu.clock.2MHz_external.build.f_cpu=2000000L

2560.menu.clock.1_8432MHz_external=External 1.8432 MHz
2560.menu.clock.1_8432MHz_external.upload.default_speed=115200
2560.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.1_8432MHz_external.build.clkpr=
2560.menu.clock.1_8432MHz_external.build.oscillator=external_oscillator
2560.menu.clock.1_8432MHz_external.build.clock_speed=1843200_hz
2560.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

2560.menu.clock.1MHz_external=External 1 MHz
2560.menu.clock.1MHz_external.upload.default_speed=9600
2560.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.1MHz_external.build.clkpr=
2560.menu.clock.1MHz_external.build.oscillator=external_oscillator
2560.menu.clock.1MHz_external.build.clock_speed=1000000_hz
2560.menu.clock.1MHz_external.build.f_cpu=1000000L

2560.menu.clock.8MHz_internal=Internal 8 MHz
2560.menu.clock.8MHz_internal.upload.default_speed=38400
2560.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.8MHz_internal.build.clkpr=
2560.menu.clock.8MHz_internal.build.oscillator=internal_oscillator
2560.menu.clock.8MHz_internal.build.clock_speed=8000000_hz
2560.menu.clock.8MHz_internal.build.f_cpu=8000000L

