Nocterra-Consulting/MegaCore/avr/boards.txt
1281.menu.clock.4MHz_external=External 4 MHz
1281.menu.clock.4MHz_external.upload.default_speed=9600
1281.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.4MHz_external.build.clkpr=
1281.menu.clock.4MHz_external.build.f_cpu=4000000L

1281.menu.clock.3_6864MHz_external=External 3.6864 MHz
1281.menu.clock.3_6864MHz_external.upload.default_speed=115200
1281.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.3_6864MHz_external.build.clkpr=
1281.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

1281.menu.clock.2MHz_external=External 2 MHz
1281.menu.clock.2MHz_external.upload.default_speed=9600
1281.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.2MHz_external.build.clkpr=
1281.menu.clock.2MHz_external.build.f_cpu=2000000L

1281.menu.clock.1_8432MHz_external=External 1.8432 MHz
1281.menu.clock.1_8432MHz_external.upload.default_speed=115200
1281.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.1_8432MHz_external.build.clkpr=
1281.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

1281.menu.clock.1MHz_external=External 1 MHz
1281.menu.clock.1MHz_external.upload.default_speed=9600
1281.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.1MHz_external.build.clkpr=
1281.menu.clock.1MHz_external.build.f_cpu=1000000L

1281.menu.clock.8MHz_internal=Internal 8 MHz
1281.menu.clock.8MHz_internal.upload.default_speed=38400
1281.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1281.menu.clock.8MHz_internal.build.clkpr=
1281.menu.clock.8MHz_internal.build.f_cpu=8000000L

1281.menu.clock.4MHz_internal=Internal 4 MHz
1281.menu.clock.4MHz_internal.upload.default_speed=9600
1281.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
1281.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
1281.menu.clock.4MHz_internal.build.f_cpu=4000000L

1281.menu.clock.2MHz_internal=Internal 2 MHz
1281.menu.clock.2MHz_internal.upload.default_speed=9600
1281.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
1281.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
1281.menu.clock.2MHz_internal.build.f_cpu=2000000L

1281.menu.clock.1MHz_internal=Internal 1 MHz
1281.menu.clock.1MHz_internal.upload.default_speed=9600
1281.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1281.menu.clock.1MHz_internal.build.clkpr=
1281.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega1280  ####
#####################

# General
1280.name=ATmega1280
1280.upload.tool=avrdude
1280.upload.maximum_data_size=8192
1280.bootloader.tool=avrdude
1280.bootloader.unlock_bits=0xff
1280.bootloader.lock_bits=0xff
1280.build.core=MCUdude_corefiles
1280.build.board=AVR_ATmega1280
1280.build.mcu=atmega1280
1280.build.bootloader_led=led+b7
1280.build.extra_flags={build.clkpr}


# Upload port select
1280.menu.bootloader.uart0=Yes (UART0)
1280.menu.bootloader.uart0.upload.maximum_size=130560
1280.menu.bootloader.uart0.upload.protocol=urclock
1280.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
1280.menu.bootloader.uart0.build.export_merged_output=true
1280.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1280.menu.bootloader.uart1=Yes (UART1)
1280.menu.bootloader.uart1.upload.maximum_size=130560
1280.menu.bootloader.uart1.upload.protocol=urclock
1280.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
1280.menu.bootloader.uart1.build.export_merged_output=true
1280.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1280.menu.bootloader.uart2=Yes (UART2)
1280.menu.bootloader.uart2.upload.maximum_size=130560
1280.menu.bootloader.uart2.upload.protocol=urclock
1280.menu.bootloader.uart2.upload.uartpins=uart2_rxh0_txh1
1280.menu.bootloader.uart2.build.export_merged_output=true
1280.menu.bootloader.uart2.bootloader.file=urboot/{build.mcu}/watchdog_1_s/{build.oscillator}/{build.clock_speed}/{upload.speed}/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1280.menu.bootloader.uart3=Yes (UART3)
1280.menu.bootloader.uart3.upload.maximum_size=130560
1280.menu.bootloader.uart3.upload.protocol=urclock
1280.menu.bootloader.uart3.upload.uartpins=uart3_rxj0_txj1
1280.menu.bootloader.uart3.build.export_merged_output=true
1280.menu.bootloader.uart3.bootloader.file=urboot/{build.mcu}/watchdog_1_s/{build.oscillator}/{build.clock_speed}/{upload.speed}/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1280.menu.bootloader.no_bootloader=No bootloader
1280.menu.bootloader.no_bootloader.upload.maximum_size=131072
1280.menu.bootloader.no_bootloader.build.export_merged_output=false
1280.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
1280.menu.eeprom.keep=EEPROM retained
1280.menu.eeprom.keep.bootloader.high_fuses=0xd7
1280.menu.eeprom.erase=EEPROM not retained
1280.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
1280.menu.baudrate.default=Default
1280.menu.baudrate.default.upload.speed={upload.default_speed}
1280.menu.baudrate.1000000=1000000
1280.menu.baudrate.1000000.upload.speed=1000000
1280.menu.baudrate.500000=500000
1280.menu.baudrate.500000.upload.speed=500000
1280.menu.baudrate.460800=460800
1280.menu.baudrate.460800.upload.speed=460800
1280.menu.baudrate.250000=250000
1280.menu.baudrate.250000.upload.speed=250000
1280.menu.baudrate.230400=230400
1280.menu.baudrate.230400.upload.speed=230400
1280.menu.baudrate.125000=125000
1280.menu.baudrate.125000.upload.speed=125000
1280.menu.baudrate.115200=115200
1280.menu.baudrate.115200.upload.speed=115200
1280.menu.baudrate.57600=57600
1280.menu.baudrate.57600.upload.speed=57600
1280.menu.baudrate.38400=38400
1280.menu.baudrate.38400.upload.speed=38400
1280.menu.baudrate.19200=19200
1280.menu.baudrate.19200.upload.speed=19200
1280.menu.baudrate.9600=9600
1280.menu.baudrate.9600.upload.speed=9600
1280.menu.baudrate.4800=4800
1280.menu.baudrate.4800.upload.speed=4800

# Pinouts
1280.menu.pinout.mega_pinout=Arduino MEGA pinout
1280.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
1280.menu.pinout.avr_pinout=AVR pinout
1280.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
1280.menu.BOD.2v7=BOD 2.7V
1280.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1280.menu.BOD.4v3=BOD 4.3V
1280.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1280.menu.BOD.1v8=BOD 1.8V
1280.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1280.menu.BOD.disabled=BOD disabled
1280.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1280.menu.LTO.Os_flto=LTO enabled
1280.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1280.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1280.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1280.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

1280.menu.LTO.Os=LTO disabled
1280.menu.LTO.Os.compiler.c.extra_flags=
1280.menu.LTO.Os.compiler.c.elf.extra_flags=
1280.menu.LTO.Os.compiler.cpp.extra_flags=
1280.menu.LTO.Os.ltoarcmd=avr-ar

