Nocterra-Consulting/MegaCore/avr/boards.txt
# Clock frequencies
1280.menu.clock.16MHz_external=External 16 MHz
1280.menu.clock.16MHz_external.upload.default_speed=115200
1280.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.16MHz_external.build.clkpr=
1280.menu.clock.16MHz_external.build.oscillator=external_oscillator
1280.menu.clock.16MHz_external.build.clock_speed=16000000_hz
1280.menu.clock.16MHz_external.build.f_cpu=16000000L

1280.menu.clock.20MHz_external=External 20 MHz
1280.menu.clock.20MHz_external.upload.default_speed=115200
1280.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.20MHz_external.build.clkpr=
1280.menu.clock.20MHz_external.build.oscillator=external_oscillator
1280.menu.clock.20MHz_external.build.clock_speed=20000000_hz
1280.menu.clock.20MHz_external.build.f_cpu=20000000L

1280.menu.clock.18_432MHz_external=External 18.4320 MHz
1280.menu.clock.18_432MHz_external.upload.default_speed=115200
1280.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.18_432MHz_external.build.clkpr=
1280.menu.clock.18_432MHz_external.build.oscillator=external_oscillator
1280.menu.clock.18_432MHz_external.build.clock_speed=18432000_hz
1280.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1280.menu.clock.14_7456MHz_external=External 14.7456 MHz
1280.menu.clock.14_7456MHz_external.upload.default_speed=115200
1280.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.14_7456MHz_external.build.clkpr=
1280.menu.clock.14_7456MHz_external.build.oscillator=external_oscillator
1280.menu.clock.14_7456MHz_external.build.clock_speed=14745600_hz
1280.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

1280.menu.clock.12MHz_external=External 12 MHz
1280.menu.clock.12MHz_external.upload.default_speed=57600
1280.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.12MHz_external.build.clkpr=
1280.menu.clock.12MHz_external.build.oscillator=external_oscillator
1280.menu.clock.12MHz_external.build.clock_speed=12000000_hz
1280.menu.clock.12MHz_external.build.f_cpu=12000000L

1280.menu.clock.11_0592MHz_external=External 11.0592 MHz
1280.menu.clock.11_0592MHz_external.upload.default_speed=115200
1280.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.11_0592MHz_external.build.clkpr=
1280.menu.clock.11_0592MHz_external.build.oscillator=external_oscillator
1280.menu.clock.11_0592MHz_external.build.clock_speed=11059200_hz
1280.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

1280.menu.clock.8MHz_external=External 8 MHz
1280.menu.clock.8MHz_external.upload.default_speed=57600
1280.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.8MHz_external.build.clkpr=
1280.menu.clock.8MHz_external.build.oscillator=external_oscillator
1280.menu.clock.8MHz_external.build.clock_speed=8000000L_hz
1280.menu.clock.8MHz_external.build.f_cpu=8000000L

1280.menu.clock.7_3728MHz_external=External 7.3728 MHz
1280.menu.clock.7_3728MHz_external.upload.default_speed=115200
1280.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.7_3728MHz_external.build.clkpr=
1280.menu.clock.7_3728MHz_external.build.oscillator=external_oscillator
1280.menu.clock.7_3728MHz_external.build.clock_speed=7372800_hz
1280.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

1280.menu.clock.6MHz_external=External 6 MHz
1280.menu.clock.6MHz_external.upload.default_speed=57600
1280.menu.clock.6MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.6MHz_external.build.clkpr=
1280.menu.clock.6MHz_external.build.oscillator=external_oscillator
1280.menu.clock.6MHz_external.build.clock_speed=6000000_hz
1280.menu.clock.6MHz_external.build.f_cpu=6000000L

1280.menu.clock.4MHz_external=External 4 MHz
1280.menu.clock.4MHz_external.upload.default_speed=9600
1280.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.4MHz_external.build.clkpr=
1280.menu.clock.4MHz_external.build.oscillator=external_oscillator
1280.menu.clock.4MHz_external.build.clock_speed=4000000_hz
1280.menu.clock.4MHz_external.build.f_cpu=4000000L

1280.menu.clock.3_6864MHz_external=External 3.6864 MHz
1280.menu.clock.3_6864MHz_external.upload.default_speed=115200
1280.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.3_6864MHz_external.build.clkpr=
1280.menu.clock.3_6864MHz_external.build.oscillator=external_oscillator
1280.menu.clock.3_6864MHz_external.build.clock_speed=3686400_hz
1280.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

1280.menu.clock.2MHz_external=External 2 MHz
1280.menu.clock.2MHz_external.upload.default_speed=9600
1280.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.2MHz_external.build.clkpr=
1280.menu.clock.2MHz_external.build.oscillator=external_oscillator
1280.menu.clock.2MHz_external.build.clock_speed=2000000_hz
1280.menu.clock.2MHz_external.build.f_cpu=2000000L

1280.menu.clock.1_8432MHz_external=External 1.8432 MHz
1280.menu.clock.1_8432MHz_external.upload.default_speed=115200
1280.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.1_8432MHz_external.build.clkpr=
1280.menu.clock.1_8432MHz_external.build.oscillator=external_oscillator
1280.menu.clock.1_8432MHz_external.build.clock_speed=1843200_hz
1280.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

1280.menu.clock.1MHz_external=External 1 MHz
1280.menu.clock.1MHz_external.upload.default_speed=9600
1280.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.1MHz_external.build.clkpr=
1280.menu.clock.1MHz_external.build.oscillator=external_oscillator
1280.menu.clock.1MHz_external.build.clock_speed=1000000_hz
1280.menu.clock.1MHz_external.build.f_cpu=1000000L

1280.menu.clock.8MHz_internal=Internal 8 MHz
1280.menu.clock.8MHz_internal.upload.default_speed=38400
1280.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.8MHz_internal.build.clkpr=
1280.menu.clock.8MHz_internal.build.oscillator=internal_oscillator
1280.menu.clock.8MHz_internal.build.clock_speed=8000000_hz
1280.menu.clock.8MHz_internal.build.f_cpu=8000000L

1280.menu.clock.4MHz_internal=Internal 4 MHz
1280.menu.clock.4MHz_internal.upload.default_speed=9600
1280.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
1280.menu.clock.4MHz_internal.build.oscillator=internal_oscillator
1280.menu.clock.4MHz_internal.build.clock_speed=8000000_hz
1280.menu.clock.4MHz_internal.build.f_cpu=4000000L

1280.menu.clock.2MHz_internal=Internal 2 MHz
1280.menu.clock.2MHz_internal.upload.default_speed=9600
1280.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
1280.menu.clock.2MHz_internal.build.oscillator=internal_oscillator
1280.menu.clock.2MHz_internal.build.clock_speed=8000000_hz
1280.menu.clock.2MHz_internal.build.f_cpu=2000000L

1280.menu.clock.1MHz_internal=Internal 1 MHz
1280.menu.clock.1MHz_internal.upload.default_speed=9600
1280.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1280.menu.clock.1MHz_internal.build.clkpr=
1280.menu.clock.1MHz_internal.build.oscillator=internal_oscillator
1280.menu.clock.1MHz_internal.build.clock_speed=1000000_hz
1280.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
####  ATmega649/6490  ####
##########################

# General
649.name=ATmega649/6490
649.upload.tool=avrdude
649.upload.maximum_data_size=4096
649.bootloader.tool=avrdude
649.bootloader.unlock_bits=0xff
649.bootloader.lock_bits=0xff
649.build.core=MCUdude_corefiles
649.build.board=AVR_ATmega649
649.build.extra_flags={build.clkpr}

# Upload port select
649.menu.bootloader.uart0=Yes (UART0)
649.menu.bootloader.uart0.upload.maximum_size=65024
649.menu.bootloader.uart0.upload.protocol=urclock
649.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
649.menu.bootloader.uart0.build.export_merged_output=true
649.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

649.menu.bootloader.no_bootloader=No bootloader
649.menu.bootloader.no_bootloader.upload.maximum_size=65536
649.menu.bootloader.no_bootloader.build.export_merged_output=false
649.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
649.menu.eeprom.keep=EEPROM retained
649.menu.eeprom.keep.bootloader.high_fuses=0xd7
649.menu.eeprom.erase=EEPROM not retained
649.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
649.menu.baudrate.default=Default
649.menu.baudrate.default.upload.speed={upload.default_speed}
649.menu.baudrate.1000000=1000000
649.menu.baudrate.1000000.upload.speed=1000000
649.menu.baudrate.500000=500000
649.menu.baudrate.500000.upload.speed=500000
649.menu.baudrate.460800=460800
649.menu.baudrate.460800.upload.speed=460800
649.menu.baudrate.250000=250000
649.menu.baudrate.250000.upload.speed=250000
649.menu.baudrate.230400=230400
649.menu.baudrate.230400.upload.speed=230400
649.menu.baudrate.125000=125000
649.menu.baudrate.125000.upload.speed=125000
649.menu.baudrate.115200=115200
649.menu.baudrate.115200.upload.speed=115200
649.menu.baudrate.57600=57600
649.menu.baudrate.57600.upload.speed=57600
649.menu.baudrate.38400=38400
649.menu.baudrate.38400.upload.speed=38400
649.menu.baudrate.19200=19200
649.menu.baudrate.19200.upload.speed=19200
649.menu.baudrate.9600=9600
649.menu.baudrate.9600.upload.speed=9600
649.menu.baudrate.4800=4800
649.menu.baudrate.4800.upload.speed=4800

