Nocterra-Consulting/MegaCore/avr/boards.txt
# Variants
649.menu.variant.model649P=649P/PA
649.menu.variant.model649P.build.mcu=atmega649p
649.menu.variant.model649P.build.variant=64-pin-avr
649.menu.variant.model649P.build.board=AVR_ATmega649
649.menu.variant.model649P.build.bootloader_led=led+b5

649.menu.variant.model649=649/A
649.menu.variant.model649.build.mcu=atmega649
649.menu.variant.model649.build.variant=64-pin-avr
649.menu.variant.model649.build.board=AVR_ATmega649
649.menu.variant.model649.build.bootloader_led=led+b5

649.menu.variant.model6490P=6490P/PA
649.menu.variant.model6490P.build.mcu=atmega6490p
649.menu.variant.model6490P.build.variant=100-pin-avr
649.menu.variant.model6490P.build.board=AVR_ATmega6490
649.menu.variant.model6490P.build.bootloader_led=led+b7

649.menu.variant.model6490=6490/A
649.menu.variant.model6490.build.mcu=atmega6490
649.menu.variant.model6490.build.variant=100-pin-avr
649.menu.variant.model6490.build.board=AVR_ATmega6490
649.menu.variant.model6490.build.bootloader_led=led+b7

# Brown out detection
649.menu.BOD.2v7=BOD 2.7V
649.menu.BOD.2v7.bootloader.extended_fuses=0xfb
649.menu.BOD.4v3=BOD 4.3V
649.menu.BOD.4v3.bootloader.extended_fuses=0xf9
649.menu.BOD.1v8=BOD 1.8V
649.menu.BOD.1v8.bootloader.extended_fuses=0xfd
649.menu.BOD.disabled=BOD disabled
649.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
649.menu.LTO.Os_flto=LTO enabled
649.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
649.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

649.menu.LTO.Os=LTO disabled
649.menu.LTO.Os.compiler.c.extra_flags=
649.menu.LTO.Os.compiler.c.elf.extra_flags=
649.menu.LTO.Os.compiler.cpp.extra_flags=
649.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
649.menu.clock.16MHz_external=External 16 MHz
649.menu.clock.16MHz_external.upload.default_speed=115200
649.menu.clock.16MHz_external.bootloader.low_fuses=0xff
649.menu.clock.16MHz_external.build.clkpr=
649.menu.clock.16MHz_external.build.f_cpu=16000000L

649.menu.clock.20MHz_external=External 20 MHz
649.menu.clock.20MHz_external.upload.default_speed=115200
649.menu.clock.20MHz_external.bootloader.low_fuses=0xff
649.menu.clock.20MHz_external.build.clkpr=
649.menu.clock.20MHz_external.build.f_cpu=20000000L

649.menu.clock.18_432MHz_external=External 18.4320 MHz
649.menu.clock.18_432MHz_external.upload.default_speed=115200
649.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.18_432MHz_external.build.clkpr=
649.menu.clock.18_432MHz_external.build.f_cpu=18432000L

649.menu.clock.14_7456MHz_external=External 14.7456 MHz
649.menu.clock.14_7456MHz_external.upload.default_speed=115200
649.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
649.menu.clock.14_7456MHz_external.build.clkpr=
649.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

649.menu.clock.12MHz_external=External 12 MHz
649.menu.clock.12MHz_external.upload.default_speed=57600
649.menu.clock.12MHz_external.bootloader.low_fuses=0xff
649.menu.clock.12MHz_external.build.clkpr=
649.menu.clock.12MHz_external.build.f_cpu=12000000L

649.menu.clock.11_0592MHz_external=External 11.0592 MHz
649.menu.clock.11_0592MHz_external.upload.default_speed=115200
649.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
649.menu.clock.11_0592MHz_external.build.clkpr=
649.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

649.menu.clock.8MHz_external=External 8 MHz
649.menu.clock.8MHz_external.upload.default_speed=57600
649.menu.clock.8MHz_external.bootloader.low_fuses=0xff
649.menu.clock.8MHz_external.build.clkpr=
649.menu.clock.8MHz_external.build.f_cpu=8000000L

649.menu.clock.7_3728MHz_external=External 7.3728 MHz
649.menu.clock.7_3728MHz_external.upload.default_speed=115200
649.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
649.menu.clock.7_3728MHz_external.build.clkpr=
649.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

649.menu.clock.6MHz_external=External 6 MHz
649.menu.clock.6MHz_external.upload.default_speed=57600
649.menu.clock.6MHz_external.bootloader.low_fuses=0xff
649.menu.clock.6MHz_external.build.clkpr=
649.menu.clock.6MHz_external.build.f_cpu=6000000L

649.menu.clock.4MHz_external=External 4 MHz
649.menu.clock.4MHz_external.upload.default_speed=9600
649.menu.clock.4MHz_external.bootloader.low_fuses=0xff
649.menu.clock.4MHz_external.build.clkpr=
649.menu.clock.4MHz_external.build.f_cpu=4000000L

649.menu.clock.3_6864MHz_external=External 3.6864 MHz
649.menu.clock.3_6864MHz_external.upload.default_speed=115200
649.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
649.menu.clock.3_6864MHz_external.build.clkpr=
649.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

649.menu.clock.2MHz_external=External 2 MHz
649.menu.clock.2MHz_external.upload.default_speed=9600
649.menu.clock.2MHz_external.bootloader.low_fuses=0xff
649.menu.clock.2MHz_external.build.clkpr=
649.menu.clock.2MHz_external.build.f_cpu=2000000L

649.menu.clock.1_8432MHz_external=External 1.8432 MHz
649.menu.clock.1_8432MHz_external.upload.default_speed=115200
649.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1_8432MHz_external.build.clkpr=
649.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

649.menu.clock.1MHz_external=External 1 MHz
649.menu.clock.1MHz_external.upload.default_speed=9600
649.menu.clock.1MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1MHz_external.build.clkpr=
649.menu.clock.1MHz_external.build.f_cpu=1000000L

649.menu.clock.8MHz_internal=Internal 8 MHz
649.menu.clock.8MHz_internal.upload.default_speed=38400
649.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.8MHz_internal.build.clkpr=
649.menu.clock.8MHz_internal.build.f_cpu=8000000L

649.menu.clock.4MHz_internal=Internal 4 MHz
649.menu.clock.4MHz_internal.upload.default_speed=9600
649.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
649.menu.clock.4MHz_internal.build.f_cpu=4000000L

649.menu.clock.2MHz_internal=Internal 2 MHz
649.menu.clock.2MHz_internal.upload.default_speed=9600
649.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
649.menu.clock.2MHz_internal.build.f_cpu=2000000L

649.menu.clock.1MHz_internal=Internal 1 MHz
649.menu.clock.1MHz_internal.upload.default_speed=9600
649.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
649.menu.clock.1MHz_internal.build.clkpr=
649.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
####  ATmega645/6450  ####
##########################

# General
645.name=ATmega645/6450
645.upload.tool=avrdude
645.upload.maximum_data_size=4096
645.bootloader.tool=avrdude
645.bootloader.unlock_bits=0xff
645.bootloader.lock_bits=0xff
645.build.core=MCUdude_corefiles
645.build.board=AVR_ATmega645
645.build.extra_flags={build.clkpr}

# Upload port select
645.menu.bootloader.uart0=Yes (UART0)
645.menu.bootloader.uart0.upload.maximum_size=65024
645.menu.bootloader.uart0.upload.protocol=urclock
645.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
645.menu.bootloader.uart0.build.export_merged_output=true
645.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

645.menu.bootloader.no_bootloader=No bootloader
645.menu.bootloader.no_bootloader.upload.maximum_size=65536
645.menu.bootloader.no_bootloader.build.export_merged_output=false
645.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
645.menu.eeprom.keep=EEPROM retained
645.menu.eeprom.keep.bootloader.high_fuses=0xd7
645.menu.eeprom.erase=EEPROM not retained
645.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
645.menu.baudrate.default=Default
645.menu.baudrate.default.upload.speed={upload.default_speed}
645.menu.baudrate.1000000=1000000
645.menu.baudrate.1000000.upload.speed=1000000
645.menu.baudrate.500000=500000
645.menu.baudrate.500000.upload.speed=500000
645.menu.baudrate.460800=460800
645.menu.baudrate.460800.upload.speed=460800
645.menu.baudrate.250000=250000
645.menu.baudrate.250000.upload.speed=250000
645.menu.baudrate.230400=230400
645.menu.baudrate.230400.upload.speed=230400
645.menu.baudrate.125000=125000
645.menu.baudrate.125000.upload.speed=125000
645.menu.baudrate.115200=115200
645.menu.baudrate.115200.upload.speed=115200
645.menu.baudrate.57600=57600
645.menu.baudrate.57600.upload.speed=57600
645.menu.baudrate.38400=38400
645.menu.baudrate.38400.upload.speed=38400
645.menu.baudrate.19200=19200
645.menu.baudrate.19200.upload.speed=19200
645.menu.baudrate.9600=9600
645.menu.baudrate.9600.upload.speed=9600
645.menu.baudrate.4800=4800
645.menu.baudrate.4800.upload.speed=4800

