Nocterra-Consulting/MegaCore/avr/boards.txt
# Variants
645.menu.variant.model645P=645P/PA
645.menu.variant.model645P.build.mcu=atmega645p
645.menu.variant.model645P.build.variant=64-pin-avr
645.menu.variant.model645P.build.board=AVR_ATmega645
645.menu.variant.model645P.build.bootloader_led=led+b5

645.menu.variant.model645=645/A
645.menu.variant.model645.build.mcu=atmega645
645.menu.variant.model645.build.variant=64-pin-avr
645.menu.variant.model645.build.board=AVR_ATmega645
645.menu.variant.model645.build.bootloader_led=led+b5

645.menu.variant.model6450P=6450P
645.menu.variant.model6450P.build.mcu=atmega6450p
645.menu.variant.model6450P.build.variant=100-pin-avr
645.menu.variant.model6450P.build.board=AVR_ATmega6450
645.menu.variant.model6450P.build.bootloader_led=led+b7

645.menu.variant.model6450=6450/A
645.menu.variant.model6450.build.mcu=atmega6450
645.menu.variant.model6450.build.variant=100-pin-avr
645.menu.variant.model6450.build.board=AVR_ATmega6450
645.menu.variant.model6450.build.bootloader_led=led+b7

# Brown out detection
645.menu.BOD.2v7=BOD 2.7V
645.menu.BOD.2v7.bootloader.extended_fuses=0xfb
645.menu.BOD.4v3=BOD 4.3V
645.menu.BOD.4v3.bootloader.extended_fuses=0xf9
645.menu.BOD.1v8=BOD 1.8V
645.menu.BOD.1v8.bootloader.extended_fuses=0xfd
645.menu.BOD.disabled=BOD disabled
645.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
645.menu.LTO.Os_flto=LTO enabled
645.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
645.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
645.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
645.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

645.menu.LTO.Os=LTO disabled
645.menu.LTO.Os.compiler.c.extra_flags=
645.menu.LTO.Os.compiler.c.elf.extra_flags=
645.menu.LTO.Os.compiler.cpp.extra_flags=
645.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
645.menu.clock.16MHz_external=External 16 MHz
645.menu.clock.16MHz_external.upload.default_speed=115200
645.menu.clock.16MHz_external.bootloader.low_fuses=0xff
645.menu.clock.16MHz_external.build.clkpr=
645.menu.clock.16MHz_external.build.f_cpu=16000000L

645.menu.clock.20MHz_external=External 20 MHz
645.menu.clock.20MHz_external.upload.default_speed=115200
645.menu.clock.20MHz_external.bootloader.low_fuses=0xff
645.menu.clock.20MHz_external.build.clkpr=
645.menu.clock.20MHz_external.build.f_cpu=20000000L

645.menu.clock.18_432MHz_external=External 18.4320 MHz
645.menu.clock.18_432MHz_external.upload.default_speed=115200
645.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
645.menu.clock.18_432MHz_external.build.clkpr=
645.menu.clock.18_432MHz_external.build.f_cpu=18432000L

645.menu.clock.14_7456MHz_external=External 14.7456 MHz
645.menu.clock.14_7456MHz_external.upload.default_speed=115200
645.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
645.menu.clock.14_7456MHz_external.build.clkpr=
645.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

645.menu.clock.12MHz_external=External 12 MHz
645.menu.clock.12MHz_external.upload.default_speed=57600
645.menu.clock.12MHz_external.bootloader.low_fuses=0xff
645.menu.clock.12MHz_external.build.clkpr=
645.menu.clock.12MHz_external.build.f_cpu=12000000L

645.menu.clock.11_0592MHz_external=External 11.0592 MHz
645.menu.clock.11_0592MHz_external.upload.default_speed=115200
645.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
645.menu.clock.11_0592MHz_external.build.clkpr=
645.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

645.menu.clock.8MHz_external=External 8 MHz
645.menu.clock.8MHz_external.upload.default_speed=57600
645.menu.clock.8MHz_external.bootloader.low_fuses=0xff
645.menu.clock.8MHz_external.build.clkpr=
645.menu.clock.8MHz_external.build.f_cpu=8000000L

645.menu.clock.7_3728MHz_external=External 7.3728 MHz
645.menu.clock.7_3728MHz_external.upload.default_speed=115200
645.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
645.menu.clock.7_3728MHz_external.build.clkpr=
645.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

645.menu.clock.6MHz_external=External 6 MHz
645.menu.clock.6MHz_external.upload.default_speed=57600
645.menu.clock.6MHz_external.bootloader.low_fuses=0xff
645.menu.clock.6MHz_external.build.clkpr=
645.menu.clock.6MHz_external.build.f_cpu=6000000L

645.menu.clock.4MHz_external=External 4 MHz
645.menu.clock.4MHz_external.upload.default_speed=9600
645.menu.clock.4MHz_external.bootloader.low_fuses=0xff
645.menu.clock.4MHz_external.build.clkpr=
645.menu.clock.4MHz_external.build.f_cpu=4000000L

645.menu.clock.3_6864MHz_external=External 3.6864 MHz
645.menu.clock.3_6864MHz_external.upload.default_speed=115200
645.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
645.menu.clock.3_6864MHz_external.build.clkpr=
645.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

645.menu.clock.2MHz_external=External 2 MHz
645.menu.clock.2MHz_external.upload.default_speed=9600
645.menu.clock.2MHz_external.bootloader.low_fuses=0xff
645.menu.clock.2MHz_external.build.clkpr=
645.menu.clock.2MHz_external.build.f_cpu=2000000L

645.menu.clock.1_8432MHz_external=External 1.8432 MHz
645.menu.clock.1_8432MHz_external.upload.default_speed=115200
645.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
645.menu.clock.1_8432MHz_external.build.clkpr=
645.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

645.menu.clock.1MHz_external=External 1 MHz
645.menu.clock.1MHz_external.upload.default_speed=9600
645.menu.clock.1MHz_external.bootloader.low_fuses=0xff
645.menu.clock.1MHz_external.build.clkpr=
645.menu.clock.1MHz_external.build.f_cpu=1000000L

645.menu.clock.8MHz_internal=Internal 8 MHz
645.menu.clock.8MHz_internal.upload.default_speed=38400
645.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.8MHz_internal.build.clkpr=
645.menu.clock.8MHz_internal.build.f_cpu=8000000L

645.menu.clock.4MHz_internal=Internal 4 MHz
645.menu.clock.4MHz_internal.upload.default_speed=9600
645.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
645.menu.clock.4MHz_internal.build.f_cpu=4000000L

