Nocterra-Consulting/MegaCore/avr/boards.txt
640.menu.clock.14_7456MHz_external=External 14.7456 MHz
640.menu.clock.14_7456MHz_external.upload.default_speed=115200
640.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.14_7456MHz_external.build.clkpr=
640.menu.clock.14_7456MHz_external.build.oscillator=external_oscillator
640.menu.clock.14_7456MHz_external.build.clock_speed=14745600_hz
640.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

640.menu.clock.12MHz_external=External 12 MHz
640.menu.clock.12MHz_external.upload.default_speed=57600
640.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.12MHz_external.build.clkpr=
640.menu.clock.12MHz_external.build.oscillator=external_oscillator
640.menu.clock.12MHz_external.build.clock_speed=12000000_hz
640.menu.clock.12MHz_external.build.f_cpu=12000000L

640.menu.clock.11_0592MHz_external=External 11.0592 MHz
640.menu.clock.11_0592MHz_external.upload.default_speed=115200
640.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.11_0592MHz_external.build.clkpr=
640.menu.clock.11_0592MHz_external.build.oscillator=external_oscillator
640.menu.clock.11_0592MHz_external.build.clock_speed=11059200_hz
640.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

640.menu.clock.8MHz_external=External 8 MHz
640.menu.clock.8MHz_external.upload.default_speed=57600
640.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.8MHz_external.build.clkpr=
640.menu.clock.8MHz_external.build.oscillator=external_oscillator
640.menu.clock.8MHz_external.build.clock_speed=8000000L_hz
640.menu.clock.8MHz_external.build.f_cpu=8000000L

640.menu.clock.7_3728MHz_external=External 7.3728 MHz
640.menu.clock.7_3728MHz_external.upload.default_speed=115200
640.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.7_3728MHz_external.build.clkpr=
640.menu.clock.7_3728MHz_external.build.oscillator=external_oscillator
640.menu.clock.7_3728MHz_external.build.clock_speed=7372800_hz
640.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

640.menu.clock.6MHz_external=External 6 MHz
640.menu.clock.6MHz_external.upload.default_speed=57600
640.menu.clock.6MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.6MHz_external.build.clkpr=
640.menu.clock.6MHz_external.build.oscillator=external_oscillator
640.menu.clock.6MHz_external.build.clock_speed=6000000_hz
640.menu.clock.6MHz_external.build.f_cpu=6000000L

640.menu.clock.4MHz_external=External 4 MHz
640.menu.clock.4MHz_external.upload.default_speed=9600
640.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.4MHz_external.build.clkpr=
640.menu.clock.4MHz_external.build.oscillator=external_oscillator
640.menu.clock.4MHz_external.build.clock_speed=4000000_hz
640.menu.clock.4MHz_external.build.f_cpu=4000000L

640.menu.clock.3_6864MHz_external=External 3.6864 MHz
640.menu.clock.3_6864MHz_external.upload.default_speed=115200
640.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.3_6864MHz_external.build.clkpr=
640.menu.clock.3_6864MHz_external.build.oscillator=external_oscillator
640.menu.clock.3_6864MHz_external.build.clock_speed=3686400_hz
640.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

640.menu.clock.2MHz_external=External 2 MHz
640.menu.clock.2MHz_external.upload.default_speed=9600
640.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.2MHz_external.build.clkpr=
640.menu.clock.2MHz_external.build.oscillator=external_oscillator
640.menu.clock.2MHz_external.build.clock_speed=2000000_hz
640.menu.clock.2MHz_external.build.f_cpu=2000000L

640.menu.clock.1_8432MHz_external=External 1.8432 MHz
640.menu.clock.1_8432MHz_external.upload.default_speed=115200
640.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.1_8432MHz_external.build.clkpr=
640.menu.clock.1_8432MHz_external.build.oscillator=external_oscillator
640.menu.clock.1_8432MHz_external.build.clock_speed=1843200_hz
640.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

640.menu.clock.1MHz_external=External 1 MHz
640.menu.clock.1MHz_external.upload.default_speed=9600
640.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.1MHz_external.build.clkpr=
640.menu.clock.1MHz_external.build.oscillator=external_oscillator
640.menu.clock.1MHz_external.build.clock_speed=1000000_hz
640.menu.clock.1MHz_external.build.f_cpu=1000000L

640.menu.clock.8MHz_internal=Internal 8 MHz
640.menu.clock.8MHz_internal.upload.default_speed=38400
640.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.8MHz_internal.build.clkpr=
640.menu.clock.8MHz_internal.build.oscillator=internal_oscillator
640.menu.clock.8MHz_internal.build.clock_speed=8000000_hz
640.menu.clock.8MHz_internal.build.f_cpu=8000000L

640.menu.clock.4MHz_internal=Internal 4 MHz
640.menu.clock.4MHz_internal.upload.default_speed=9600
640.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
640.menu.clock.4MHz_internal.build.oscillator=internal_oscillator
640.menu.clock.4MHz_internal.build.clock_speed=8000000_hz
640.menu.clock.4MHz_internal.build.f_cpu=4000000L

640.menu.clock.2MHz_internal=Internal 2 MHz
640.menu.clock.2MHz_internal.upload.default_speed=9600
640.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
640.menu.clock.2MHz_internal.build.oscillator=internal_oscillator
640.menu.clock.2MHz_internal.build.clock_speed=8000000_hz
640.menu.clock.2MHz_internal.build.f_cpu=2000000L

640.menu.clock.1MHz_internal=Internal 1 MHz
640.menu.clock.1MHz_internal.upload.default_speed=9600
640.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
640.menu.clock.1MHz_internal.build.clkpr=
640.menu.clock.1MHz_internal.build.oscillator=internal_oscillator
640.menu.clock.1MHz_internal.build.clock_speed=1000000_hz
640.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
####  ATmega329/3290  ####
##########################

# General
329.name=ATmega329/3290
329.upload.tool=avrdude
329.upload.maximum_data_size=2048
329.bootloader.tool=avrdude
329.bootloader.unlock_bits=0xff
329.bootloader.lock_bits=0xff
329.build.core=MCUdude_corefiles
329.build.board=AVR_ATmega329
329.build.extra_flags={build.clkpr}

# Upload port select
329.menu.bootloader.uart0=Yes (UART0)
329.menu.bootloader.uart0.upload.maximum_size=32384
329.menu.bootloader.uart0.upload.protocol=urclock
329.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
329.menu.bootloader.uart0.build.export_merged_output=true
329.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

329.menu.bootloader.no_bootloader=No bootloader
329.menu.bootloader.no_bootloader.upload.maximum_size=32768
329.menu.bootloader.no_bootloader.build.export_merged_output=false
329.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
329.menu.eeprom.keep=EEPROM retained
329.menu.eeprom.keep.bootloader.high_fuses=0xd7
329.menu.eeprom.erase=EEPROM not retained
329.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
329.menu.baudrate.default=Default
329.menu.baudrate.default.upload.speed={upload.default_speed}
329.menu.baudrate.1000000=1000000
329.menu.baudrate.1000000.upload.speed=1000000
329.menu.baudrate.500000=500000
329.menu.baudrate.500000.upload.speed=500000
329.menu.baudrate.460800=460800
329.menu.baudrate.460800.upload.speed=460800
329.menu.baudrate.250000=250000
329.menu.baudrate.250000.upload.speed=250000
329.menu.baudrate.230400=230400
329.menu.baudrate.230400.upload.speed=230400
329.menu.baudrate.125000=125000
329.menu.baudrate.125000.upload.speed=125000
329.menu.baudrate.115200=115200
329.menu.baudrate.115200.upload.speed=115200
329.menu.baudrate.57600=57600
329.menu.baudrate.57600.upload.speed=57600
329.menu.baudrate.38400=38400
329.menu.baudrate.38400.upload.speed=38400
329.menu.baudrate.19200=19200
329.menu.baudrate.19200.upload.speed=19200
329.menu.baudrate.9600=9600
329.menu.baudrate.9600.upload.speed=9600
329.menu.baudrate.4800=4800
329.menu.baudrate.4800.upload.speed=4800

