Nocterra-Consulting/MegaCore/avr/boards.txt
325.menu.clock.2MHz_internal=Internal 2 MHz
325.menu.clock.2MHz_internal.upload.default_speed=9600
325.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
325.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
325.menu.clock.2MHz_internal.build.f_cpu=2000000L

325.menu.clock.1MHz_internal=Internal 1 MHz
325.menu.clock.1MHz_internal.upload.default_speed=9600
325.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
325.menu.clock.1MHz_internal.build.clkpr=
325.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega169  ####
#####################

# General
169.name=ATmega169
169.upload.tool=avrdude
169.upload.maximum_data_size=1024
169.bootloader.tool=avrdude
169.bootloader.unlock_bits=0xff
169.bootloader.lock_bits=0xff
169.build.core=MCUdude_corefiles
169.build.variant=64-pin-avr
169.build.board=AVR_ATmega169
169.build.bootloader_led=led+b5
169.build.extra_flags={build.clkpr}

# Upload port select
169.menu.bootloader.uart0=Yes (UART0)
169.menu.bootloader.uart0.upload.maximum_size=16000
169.menu.bootloader.uart0.upload.protocol=urclock
169.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
169.menu.bootloader.uart0.build.export_merged_output=true
169.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

169.menu.bootloader.no_bootloader=No bootloader
169.menu.bootloader.no_bootloader.upload.maximum_size=16384
169.menu.bootloader.no_bootloader.build.export_merged_output=false
169.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
169.menu.eeprom.keep=EEPROM retained
169.menu.eeprom.keep.bootloader.high_fuses=0xd7
169.menu.eeprom.erase=EEPROM not retained
169.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
169.menu.baudrate.default=Default
169.menu.baudrate.default.upload.speed={upload.default_speed}
169.menu.baudrate.1000000=1000000
169.menu.baudrate.1000000.upload.speed=1000000
169.menu.baudrate.500000=500000
169.menu.baudrate.500000.upload.speed=500000
169.menu.baudrate.460800=460800
169.menu.baudrate.460800.upload.speed=460800
169.menu.baudrate.250000=250000
169.menu.baudrate.250000.upload.speed=250000
169.menu.baudrate.230400=230400
169.menu.baudrate.230400.upload.speed=230400
169.menu.baudrate.125000=125000
169.menu.baudrate.125000.upload.speed=125000
169.menu.baudrate.115200=115200
169.menu.baudrate.115200.upload.speed=115200
169.menu.baudrate.57600=57600
169.menu.baudrate.57600.upload.speed=57600
169.menu.baudrate.38400=38400
169.menu.baudrate.38400.upload.speed=38400
169.menu.baudrate.19200=19200
169.menu.baudrate.19200.upload.speed=19200
169.menu.baudrate.9600=9600
169.menu.baudrate.9600.upload.speed=9600
169.menu.baudrate.4800=4800
169.menu.baudrate.4800.upload.speed=4800

# Variants
169.menu.variant.modelP=169P/PA
169.menu.variant.modelP.build.mcu=atmega169p
169.menu.variant.modelA=169/A
169.menu.variant.modelA.build.mcu=atmega169a

# Brown out detection
169.menu.BOD.2v7=BOD 2.7V
169.menu.BOD.2v7.bootloader.extended_fuses=0xfb
169.menu.BOD.4v3=BOD 4.3V
169.menu.BOD.4v3.bootloader.extended_fuses=0xf9
169.menu.BOD.1v8=BOD 1.8V
169.menu.BOD.1v8.bootloader.extended_fuses=0xfd
169.menu.BOD.disabled=BOD disabled
169.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
169.menu.LTO.Os_flto=LTO enabled
169.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
169.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
169.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
169.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

169.menu.LTO.Os=LTO disabled
169.menu.LTO.Os.compiler.c.extra_flags=
169.menu.LTO.Os.compiler.c.elf.extra_flags=
169.menu.LTO.Os.compiler.cpp.extra_flags=
169.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
169.menu.clock.16MHz_external=External 16 MHz
169.menu.clock.16MHz_external.upload.default_speed=115200
169.menu.clock.16MHz_external.bootloader.low_fuses=0xff
169.menu.clock.16MHz_external.build.clkpr=
169.menu.clock.16MHz_external.build.f_cpu=16000000L

169.menu.clock.20MHz_external=External 20 MHz
169.menu.clock.20MHz_external.upload.default_speed=115200
169.menu.clock.20MHz_external.bootloader.low_fuses=0xff
169.menu.clock.20MHz_external.build.clkpr=
169.menu.clock.20MHz_external.build.f_cpu=20000000L

169.menu.clock.18_432MHz_external=External 18.4320 MHz
169.menu.clock.18_432MHz_external.upload.default_speed=115200
169.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
169.menu.clock.18_432MHz_external.build.clkpr=
169.menu.clock.18_432MHz_external.build.f_cpu=18432000L

169.menu.clock.14_7456MHz_external=External 14.7456 MHz
169.menu.clock.14_7456MHz_external.upload.default_speed=115200
169.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
169.menu.clock.14_7456MHz_external.build.clkpr=
169.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

169.menu.clock.12MHz_external=External 12 MHz
169.menu.clock.12MHz_external.upload.default_speed=57600
169.menu.clock.12MHz_external.bootloader.low_fuses=0xff
169.menu.clock.12MHz_external.build.clkpr=
169.menu.clock.12MHz_external.build.f_cpu=12000000L

169.menu.clock.11_0592MHz_external=External 11.0592 MHz
169.menu.clock.11_0592MHz_external.upload.default_speed=115200
169.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
169.menu.clock.11_0592MHz_external.build.clkpr=
169.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

169.menu.clock.8MHz_external=External 8 MHz
169.menu.clock.8MHz_external.upload.default_speed=57600
169.menu.clock.8MHz_external.bootloader.low_fuses=0xff
169.menu.clock.8MHz_external.build.clkpr=
169.menu.clock.8MHz_external.build.f_cpu=8000000L

169.menu.clock.7_3728MHz_external=External 7.3728 MHz
169.menu.clock.7_3728MHz_external.upload.default_speed=115200
169.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
169.menu.clock.7_3728MHz_external.build.clkpr=
169.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

169.menu.clock.6MHz_external=External 6 MHz
169.menu.clock.6MHz_external.upload.default_speed=57600
169.menu.clock.6MHz_external.bootloader.low_fuses=0xff
169.menu.clock.6MHz_external.build.clkpr=
169.menu.clock.6MHz_external.build.f_cpu=6000000L

169.menu.clock.4MHz_external=External 4 MHz
169.menu.clock.4MHz_external.upload.default_speed=9600
169.menu.clock.4MHz_external.bootloader.low_fuses=0xff
169.menu.clock.4MHz_external.build.clkpr=
169.menu.clock.4MHz_external.build.f_cpu=4000000L

169.menu.clock.3_6864MHz_external=External 3.6864 MHz
169.menu.clock.3_6864MHz_external.upload.default_speed=115200
169.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
169.menu.clock.3_6864MHz_external.build.clkpr=
169.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

169.menu.clock.2MHz_external=External 2 MHz
169.menu.clock.2MHz_external.upload.default_speed=9600
169.menu.clock.2MHz_external.bootloader.low_fuses=0xff
169.menu.clock.2MHz_external.build.clkpr=
169.menu.clock.2MHz_external.build.f_cpu=2000000L

169.menu.clock.1_8432MHz_external=External 1.8432 MHz
169.menu.clock.1_8432MHz_external.upload.default_speed=115200
169.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
169.menu.clock.1_8432MHz_external.build.clkpr=
169.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

169.menu.clock.1MHz_external=External 1 MHz
169.menu.clock.1MHz_external.upload.default_speed=9600
169.menu.clock.1MHz_external.bootloader.low_fuses=0xff
169.menu.clock.1MHz_external.build.clkpr=
169.menu.clock.1MHz_external.build.f_cpu=1000000L

