Nocterra-Consulting/MegaCore/avr/boards.txt
169.menu.clock.8MHz_internal=Internal 8 MHz
169.menu.clock.8MHz_internal.upload.default_speed=38400
169.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
169.menu.clock.8MHz_internal.build.clkpr=
169.menu.clock.8MHz_internal.build.f_cpu=8000000L

169.menu.clock.4MHz_internal=Internal 4 MHz
169.menu.clock.4MHz_internal.upload.default_speed=9600
169.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
169.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
169.menu.clock.4MHz_internal.build.f_cpu=4000000L

169.menu.clock.2MHz_internal=Internal 2 MHz
169.menu.clock.2MHz_internal.upload.default_speed=9600
169.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
169.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
169.menu.clock.2MHz_internal.build.f_cpu=2000000L

169.menu.clock.1MHz_internal=Internal 1 MHz
169.menu.clock.1MHz_internal.upload.default_speed=9600
169.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
169.menu.clock.1MHz_internal.build.clkpr=
169.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega165  ####
#####################

# General
165.name=ATmega165
165.upload.tool=avrdude
165.upload.maximum_data_size=1024
165.bootloader.tool=avrdude
165.bootloader.unlock_bits=0xff
165.bootloader.lock_bits=0xff
165.build.core=MCUdude_corefiles
165.build.variant=64-pin-avr
165.build.board=AVR_ATmega165
165.build.bootloader_led=led+b5
165.build.extra_flags={build.clkpr}

# Upload port select
165.menu.bootloader.uart0=Yes (UART0)
165.menu.bootloader.uart0.upload.maximum_size=16000
165.menu.bootloader.uart0.upload.protocol=urclock
165.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
165.menu.bootloader.uart0.build.export_merged_output=true
165.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

165.menu.bootloader.no_bootloader=No bootloader
165.menu.bootloader.no_bootloader.upload.maximum_size=16384
165.menu.bootloader.no_bootloader.build.export_merged_output=false
165.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
165.menu.eeprom.keep=EEPROM retained
165.menu.eeprom.keep.bootloader.high_fuses=0xd7
165.menu.eeprom.erase=EEPROM not retained
165.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
165.menu.baudrate.default=Default
165.menu.baudrate.default.upload.speed={upload.default_speed}
165.menu.baudrate.1000000=1000000
165.menu.baudrate.1000000.upload.speed=1000000
165.menu.baudrate.500000=500000
165.menu.baudrate.500000.upload.speed=500000
165.menu.baudrate.460800=460800
165.menu.baudrate.460800.upload.speed=460800
165.menu.baudrate.250000=250000
165.menu.baudrate.250000.upload.speed=250000
165.menu.baudrate.230400=230400
165.menu.baudrate.230400.upload.speed=230400
165.menu.baudrate.125000=125000
165.menu.baudrate.125000.upload.speed=125000
165.menu.baudrate.115200=115200
165.menu.baudrate.115200.upload.speed=115200
165.menu.baudrate.57600=57600
165.menu.baudrate.57600.upload.speed=57600
165.menu.baudrate.38400=38400
165.menu.baudrate.38400.upload.speed=38400
165.menu.baudrate.19200=19200
165.menu.baudrate.19200.upload.speed=19200
165.menu.baudrate.9600=9600
165.menu.baudrate.9600.upload.speed=9600
165.menu.baudrate.4800=4800
165.menu.baudrate.4800.upload.speed=4800

# Variants
165.menu.variant.modelP=165P/PA
165.menu.variant.modelP.build.mcu=atmega165p
165.menu.variant.modelA=165A
165.menu.variant.modelA.build.mcu=atmega165a

# Brown out detection
165.menu.BOD.2v7=BOD 2.7V
165.menu.BOD.2v7.bootloader.extended_fuses=0xfb
165.menu.BOD.4v3=BOD 4.3V
165.menu.BOD.4v3.bootloader.extended_fuses=0xf9
165.menu.BOD.1v8=BOD 1.8V
165.menu.BOD.1v8.bootloader.extended_fuses=0xfd
165.menu.BOD.disabled=BOD disabled
165.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
165.menu.LTO.Os_flto=LTO enabled
165.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
165.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
165.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
165.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

165.menu.LTO.Os=LTO disabled
165.menu.LTO.Os.compiler.c.extra_flags=
165.menu.LTO.Os.compiler.c.elf.extra_flags=
165.menu.LTO.Os.compiler.cpp.extra_flags=
165.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
165.menu.clock.16MHz_external=External 16 MHz
165.menu.clock.16MHz_external.upload.default_speed=115200
165.menu.clock.16MHz_external.bootloader.low_fuses=0xff
165.menu.clock.16MHz_external.build.clkpr=
165.menu.clock.16MHz_external.build.f_cpu=16000000L

165.menu.clock.20MHz_external=External 20 MHz
165.menu.clock.20MHz_external.upload.default_speed=115200
165.menu.clock.20MHz_external.bootloader.low_fuses=0xff
165.menu.clock.20MHz_external.build.clkpr=
165.menu.clock.20MHz_external.build.f_cpu=20000000L

165.menu.clock.18_432MHz_external=External 18.4320 MHz
165.menu.clock.18_432MHz_external.upload.default_speed=115200
165.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
165.menu.clock.18_432MHz_external.build.clkpr=
165.menu.clock.18_432MHz_external.build.f_cpu=18432000L

165.menu.clock.14_7456MHz_external=External 14.7456 MHz
165.menu.clock.14_7456MHz_external.upload.default_speed=115200
165.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
165.menu.clock.14_7456MHz_external.build.clkpr=
165.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

165.menu.clock.12MHz_external=External 12 MHz
165.menu.clock.12MHz_external.upload.default_speed=57600
165.menu.clock.12MHz_external.bootloader.low_fuses=0xff
165.menu.clock.12MHz_external.build.clkpr=
165.menu.clock.12MHz_external.build.f_cpu=12000000L

165.menu.clock.11_0592MHz_external=External 11.0592 MHz
165.menu.clock.11_0592MHz_external.upload.default_speed=115200
165.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
165.menu.clock.11_0592MHz_external.build.clkpr=
165.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

165.menu.clock.8MHz_external=External 8 MHz
165.menu.clock.8MHz_external.upload.default_speed=57600
165.menu.clock.8MHz_external.bootloader.low_fuses=0xff
165.menu.clock.8MHz_external.build.clkpr=
165.menu.clock.8MHz_external.build.f_cpu=8000000L

