Nocterra-Consulting/MegaCore/avr/boards.txt
# Clock frequencies
128.menu.clock.16MHz_external=External 16 MHz
128.menu.clock.16MHz_external.upload.default_speed=115200
128.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.16MHz_external.bootloader.ckopt_bit=0
128.menu.clock.16MHz_external.build.f_cpu=16000000L

128.menu.clock.20MHz_external=External 20 MHz
128.menu.clock.20MHz_external.upload.default_speed=115200
128.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.20MHz_external.bootloader.ckopt_bit=0
128.menu.clock.20MHz_external.build.f_cpu=20000000L

128.menu.clock.18_432MHz_external=External 18.432 MHz
128.menu.clock.18_432MHz_external.upload.default_speed=115200
128.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
128.menu.clock.18_432MHz_external.build.f_cpu=18432000L

128.menu.clock.14_7456MHz_external=External 14.7456 MHz
128.menu.clock.14_7456MHz_external.upload.default_speed=115200
128.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
128.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

128.menu.clock.12MHz_external=External 12 MHz
128.menu.clock.12MHz_external.upload.default_speed=57600
128.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.12MHz_external.bootloader.ckopt_bit=0
128.menu.clock.12MHz_external.build.f_cpu=12000000L

128.menu.clock.11_0592MHz_external=External 11.0592 MHz
128.menu.clock.11_0592MHz_external.upload.default_speed=115200
128.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
128.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

128.menu.clock.8MHz_external=External 8 MHz
128.menu.clock.8MHz_external.upload.default_speed=57600
128.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.8MHz_external.bootloader.ckopt_bit=0
128.menu.clock.8MHz_external.build.f_cpu=8000000L

128.menu.clock.7_3728MHz_external=External 7.3728 MHz
128.menu.clock.7_3728MHz_external.upload.default_speed=115200
128.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
128.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

128.menu.clock.6MHz_external=External 6 MHz
128.menu.clock.6MHz_external.upload.default_speed=57600
128.menu.clock.6MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.6MHz_external.bootloader.ckopt_bit=0
128.menu.clock.6MHz_external.build.f_cpu=6000000L

128.menu.clock.4MHz_external=External 4 MHz
128.menu.clock.4MHz_external.upload.default_speed=9600
128.menu.clock.4MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.4MHz_external.bootloader.ckopt_bit=0
128.menu.clock.4MHz_external.build.f_cpu=4000000L

128.menu.clock.3_6864MHz_external=External 3.6864 MHz
128.menu.clock.3_6864MHz_external.upload.default_speed=115200
128.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
128.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

128.menu.clock.2MHz_external=External 2 MHz
128.menu.clock.2MHz_external.upload.default_speed=9600
128.menu.clock.2MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.2MHz_external.bootloader.ckopt_bit=0
128.menu.clock.2MHz_external.build.f_cpu=2000000L

128.menu.clock.1_8432MHz_external=External 1.8432 MHz
128.menu.clock.1_8432MHz_external.upload.default_speed=115200
128.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
128.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

128.menu.clock.1MHz_external=External 1 MHz
128.menu.clock.1MHz_external.upload.default_speed=9600
128.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
128.menu.clock.1MHz_external.bootloader.ckopt_bit=0
128.menu.clock.1MHz_external.build.f_cpu=1000000L

128.menu.clock.8MHz_internal=Internal 8 MHz
128.menu.clock.8MHz_internal.upload.default_speed=38400
128.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
128.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
128.menu.clock.8MHz_internal.build.f_cpu=8000000L

128.menu.clock.4MHz_internal=Internal 4 MHz
128.menu.clock.4MHz_internal.upload.default_speed=9600
128.menu.clock.4MHz_internal.bootloader.sut_cksel_bits=100011
128.menu.clock.4MHz_internal.bootloader.ckopt_bit=1
128.menu.clock.4MHz_internal.build.f_cpu=4000000L

128.menu.clock.2MHz_internal=Internal 2 MHz
128.menu.clock.2MHz_internal.upload.default_speed=9600
128.menu.clock.2MHz_internal.bootloader.sut_cksel_bits=100010
128.menu.clock.2MHz_internal.bootloader.ckopt_bit=1
128.menu.clock.2MHz_internal.build.f_cpu=2000000L

128.menu.clock.1MHz_internal=Internal 1 MHz
128.menu.clock.1MHz_internal.upload.default_speed=9600
128.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
128.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
128.menu.clock.1MHz_internal.build.f_cpu=1000000L



####################
#### ATmega64/A ####
####################

# General
64.name=ATmega64
64.upload.tool=avrdude
64.upload.maximum_data_size=4096
64.bootloader.tool=avrdude
64.bootloader.unlock_bits=0xff
64.bootloader.lock_bits=0xff
64.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
64.bootloader.high_fuses=0b110{bootloader.ckopt_bit}{bootloader.eesave_bit}111
64.bootloader.extended_fuses=0xff
64.build.core=MCUdude_corefiles
64.build.variant=64-pin-avr
64.build.board=AVR_ATmega64
64.build.mcu=atmega64
64.build.bootloader_led=led+b5

# Upload port select
64.menu.bootloader.uart0=Yes (UART0)
64.menu.bootloader.uart0.upload.maximum_size=65024
64.menu.bootloader.uart0.upload.protocol=urclock
64.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
64.menu.bootloader.uart0.build.export_merged_output=true
64.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

