Nocterra-Consulting/MegaCore/avr/boards.txt
64.menu.bootloader.uart1=Yes (UART1)
64.menu.bootloader.uart1.upload.maximum_size=65024
64.menu.bootloader.uart1.upload.protocol=urclock
64.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
64.menu.bootloader.uart1.build.export_merged_output=true
64.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

64.menu.bootloader.no_bootloader=No bootloader
64.menu.bootloader.no_bootloader.upload.maximum_size=65536
64.menu.bootloader.no_bootloader.build.export_merged_output=false
64.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
64.menu.eeprom.keep=EEPROM retained
64.menu.eeprom.keep.bootloader.eesave_bit=0
64.menu.eeprom.erase=EEPROM not retained
64.menu.eeprom.erase.bootloader.eesave_bit=1

# Baud rate
64.menu.baudrate.default=Default
64.menu.baudrate.default.upload.speed={upload.default_speed}
64.menu.baudrate.1000000=1000000
64.menu.baudrate.1000000.upload.speed=1000000
64.menu.baudrate.500000=500000
64.menu.baudrate.500000.upload.speed=500000
64.menu.baudrate.460800=460800
64.menu.baudrate.460800.upload.speed=460800
64.menu.baudrate.250000=250000
64.menu.baudrate.250000.upload.speed=250000
64.menu.baudrate.230400=230400
64.menu.baudrate.230400.upload.speed=230400
64.menu.baudrate.125000=125000
64.menu.baudrate.125000.upload.speed=125000
64.menu.baudrate.115200=115200
64.menu.baudrate.115200.upload.speed=115200
64.menu.baudrate.57600=57600
64.menu.baudrate.57600.upload.speed=57600
64.menu.baudrate.38400=38400
64.menu.baudrate.38400.upload.speed=38400
64.menu.baudrate.19200=19200
64.menu.baudrate.19200.upload.speed=19200
64.menu.baudrate.9600=9600
64.menu.baudrate.9600.upload.speed=9600
64.menu.baudrate.4800=4800
64.menu.baudrate.4800.upload.speed=4800

# Brown out detection - This is the first part of the low fuse bit concatenation
64.menu.BOD.2v7=BOD 2.7V
64.menu.BOD.2v7.bootloader.bod_bits=10
64.menu.BOD.4v0=BOD 4.0V
64.menu.BOD.4v0.bootloader.bod_bits=00
64.menu.BOD.disabled=BOD disabled
64.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
64.menu.LTO.Os_flto=LTO enabled
64.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
64.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
64.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
64.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

64.menu.LTO.Os=LTO disabled
64.menu.LTO.Os.compiler.c.extra_flags=
64.menu.LTO.Os.compiler.c.elf.extra_flags=
64.menu.LTO.Os.compiler.cpp.extra_flags=
64.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
64.menu.clock.16MHz_external=External 16 MHz
64.menu.clock.16MHz_external.upload.default_speed=115200
64.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.16MHz_external.bootloader.ckopt_bit=0
64.menu.clock.16MHz_external.build.f_cpu=16000000L

64.menu.clock.20MHz_external=External 20 MHz
64.menu.clock.20MHz_external.upload.default_speed=115200
64.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.20MHz_external.bootloader.ckopt_bit=0
64.menu.clock.20MHz_external.build.f_cpu=20000000L

64.menu.clock.18_432MHz_external=External 18.432 MHz
64.menu.clock.18_432MHz_external.upload.default_speed=115200
64.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
64.menu.clock.18_432MHz_external.build.f_cpu=18432000L

64.menu.clock.14_7456MHz_external=External 14.7456 MHz
64.menu.clock.14_7456MHz_external.upload.default_speed=115200
64.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
64.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

64.menu.clock.12MHz_external=External 12 MHz
64.menu.clock.12MHz_external.upload.default_speed=57600
64.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.12MHz_external.bootloader.ckopt_bit=0
64.menu.clock.12MHz_external.build.f_cpu=12000000L

64.menu.clock.11_0592MHz_external=External 11.0592 MHz
64.menu.clock.11_0592MHz_external.upload.default_speed=115200
64.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
64.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

64.menu.clock.8MHz_external=External 8 MHz
64.menu.clock.8MHz_external.upload.default_speed=57600
64.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.8MHz_external.bootloader.ckopt_bit=0
64.menu.clock.8MHz_external.build.f_cpu=8000000L

64.menu.clock.7_3728MHz_external=External 7.3728 MHz
64.menu.clock.7_3728MHz_external.upload.default_speed=115200
64.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
64.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

64.menu.clock.6MHz_external=External 6 MHz
64.menu.clock.6MHz_external.upload.default_speed=57600
64.menu.clock.6MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.6MHz_external.bootloader.ckopt_bit=0
64.menu.clock.6MHz_external.build.f_cpu=6000000L

64.menu.clock.4MHz_external=External 4 MHz
64.menu.clock.4MHz_external.upload.default_speed=9600
64.menu.clock.4MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.4MHz_external.bootloader.ckopt_bit=0
64.menu.clock.4MHz_external.build.f_cpu=4000000L

64.menu.clock.3_6864MHz_external=External 3.6864 MHz
64.menu.clock.3_6864MHz_external.upload.default_speed=115200
64.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
64.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

64.menu.clock.2MHz_external=External 2 MHz
64.menu.clock.2MHz_external.upload.default_speed=9600
64.menu.clock.2MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.2MHz_external.bootloader.ckopt_bit=0
64.menu.clock.2MHz_external.build.f_cpu=2000000L

64.menu.clock.1_8432MHz_external=External 1.8432 MHz
64.menu.clock.1_8432MHz_external.upload.default_speed=115200
64.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
64.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

64.menu.clock.1MHz_external=External 1 MHz
64.menu.clock.1MHz_external.upload.default_speed=9600
64.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.1MHz_external.bootloader.ckopt_bit=0
64.menu.clock.1MHz_external.build.f_cpu=1000000L

64.menu.clock.8MHz_internal=Internal 8 MHz
64.menu.clock.8MHz_internal.upload.default_speed=38400
64.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
64.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
64.menu.clock.8MHz_internal.build.f_cpu=8000000L

