Nocterra-Consulting/MegaCore/avr/boards.txt
64.menu.clock.4MHz_internal=Internal 4 MHz
64.menu.clock.4MHz_internal.upload.default_speed=9600
64.menu.clock.4MHz_internal.bootloader.sut_cksel_bits=100011
64.menu.clock.4MHz_internal.bootloader.ckopt_bit=1
64.menu.clock.4MHz_internal.build.f_cpu=4000000L

64.menu.clock.2MHz_internal=Internal 2 MHz
64.menu.clock.2MHz_internal.upload.default_speed=9600
64.menu.clock.2MHz_internal.bootloader.sut_cksel_bits=100010
64.menu.clock.2MHz_internal.bootloader.ckopt_bit=1
64.menu.clock.2MHz_internal.build.f_cpu=2000000L

64.menu.clock.1MHz_internal=Internal 1 MHz
64.menu.clock.1MHz_internal.upload.default_speed=9600
64.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
64.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
64.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### AT90CAN128  ####
#####################

# General
can128.name=AT90CAN128
can128.upload.tool=avrdude
can128.upload.maximum_data_size=4096
can128.bootloader.tool=avrdude
can128.bootloader.unlock_bits=0xff
can128.bootloader.lock_bits=0xff
can128.build.core=MCUdude_corefiles
can128.build.variant=64-pin-avr
can128.build.board=AVR_AT90CAN128
can128.build.mcu=at90can128
can128.build.bootloader_led=led+b5
can128.build.extra_flags={build.clkpr}

# Upload port select
can128.menu.bootloader.uart0=Yes (UART0)
can128.menu.bootloader.uart0.upload.maximum_size=130560
can128.menu.bootloader.uart0.upload.protocol=urclock
can128.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
can128.menu.bootloader.uart0.build.export_merged_output=true
can128.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

can128.menu.bootloader.uart1=Yes (UART1)
can128.menu.bootloader.uart1.upload.maximum_size=130560
can128.menu.bootloader.uart1.upload.protocol=urclock
can128.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
can128.menu.bootloader.uart1.build.export_merged_output=true
can128.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

can128.menu.bootloader.no_bootloader=No bootloader
can128.menu.bootloader.no_bootloader.upload.maximum_size=131072
can128.menu.bootloader.no_bootloader.build.export_merged_output=false
can128.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
can128.menu.eeprom.keep=EEPROM retained
can128.menu.eeprom.keep.bootloader.high_fuses=0xd7
can128.menu.eeprom.erase=EEPROM not retained
can128.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
can128.menu.baudrate.default=Default
can128.menu.baudrate.default.upload.speed={upload.default_speed}
can128.menu.baudrate.1000000=1000000
can128.menu.baudrate.1000000.upload.speed=1000000
can128.menu.baudrate.500000=500000
can128.menu.baudrate.500000.upload.speed=500000
can128.menu.baudrate.460800=460800
can128.menu.baudrate.460800.upload.speed=460800
can128.menu.baudrate.250000=250000
can128.menu.baudrate.250000.upload.speed=250000
can128.menu.baudrate.230400=230400
can128.menu.baudrate.230400.upload.speed=230400
can128.menu.baudrate.125000=125000
can128.menu.baudrate.125000.upload.speed=125000
can128.menu.baudrate.115200=115200
can128.menu.baudrate.115200.upload.speed=115200
can128.menu.baudrate.57600=57600
can128.menu.baudrate.57600.upload.speed=57600
can128.menu.baudrate.38400=38400
can128.menu.baudrate.38400.upload.speed=38400
can128.menu.baudrate.19200=19200
can128.menu.baudrate.19200.upload.speed=19200
can128.menu.baudrate.9600=9600
can128.menu.baudrate.9600.upload.speed=9600
can128.menu.baudrate.4800=4800
can128.menu.baudrate.4800.upload.speed=4800

# Brown out detection
can128.menu.BOD.2v7=BOD 2.7V
can128.menu.BOD.2v7.bootloader.extended_fuses=0xf5
can128.menu.BOD.4v1=BOD 4.1V
can128.menu.BOD.4v1.bootloader.extended_fuses=0xfd
can128.menu.BOD.4v0=BOD 4.0V
can128.menu.BOD.4v0.bootloader.extended_fuses=0xfb
can128.menu.BOD.3v9=BOD 3.9V
can128.menu.BOD.3v9.bootloader.extended_fuses=0xf9
can128.menu.BOD.3v8=BOD 3.8V
can128.menu.BOD.3v8.bootloader.extended_fuses=0xf7
can128.menu.BOD.2v6=BOD 2.6V
can128.menu.BOD.2v6.bootloader.extended_fuses=0xf3
can128.menu.BOD.2v5=BOD 2.5V
can128.menu.BOD.2v5.bootloader.extended_fuses=0xf1
can128.menu.BOD.disabled=BOD disabled
can128.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
can128.menu.LTO.Os_flto=LTO enabled
can128.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
can128.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
can128.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
can128.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

can128.menu.LTO.Os=LTO disabled
can128.menu.LTO.Os.compiler.c.extra_flags=
can128.menu.LTO.Os.compiler.c.elf.extra_flags=
can128.menu.LTO.Os.compiler.cpp.extra_flags=
can128.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
can128.menu.clock.16MHz_external=External 16 MHz
can128.menu.clock.16MHz_external.upload.default_speed=115200
can128.menu.clock.16MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.16MHz_external.build.clkpr=
can128.menu.clock.16MHz_external.build.f_cpu=16000000L

can128.menu.clock.20MHz_external=External 20 MHz
can128.menu.clock.20MHz_external.upload.default_speed=115200
can128.menu.clock.20MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.20MHz_external.build.clkpr=
can128.menu.clock.20MHz_external.build.f_cpu=20000000L

can128.menu.clock.18_432MHz_external=External 18.4320 MHz
can128.menu.clock.18_432MHz_external.upload.default_speed=115200
can128.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.18_432MHz_external.build.clkpr=
can128.menu.clock.18_432MHz_external.build.f_cpu=18432000L

can128.menu.clock.14_7456MHz_external=External 14.7456 MHz
can128.menu.clock.14_7456MHz_external.upload.default_speed=115200
can128.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.14_7456MHz_external.build.clkpr=
can128.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

can128.menu.clock.12MHz_external=External 12 MHz
can128.menu.clock.12MHz_external.upload.default_speed=57600
can128.menu.clock.12MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.12MHz_external.build.clkpr=
can128.menu.clock.12MHz_external.build.f_cpu=12000000L

can128.menu.clock.11_0592MHz_external=External 11.0592 MHz
can128.menu.clock.11_0592MHz_external.upload.default_speed=115200
can128.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.11_0592MHz_external.build.clkpr=
can128.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

can128.menu.clock.8MHz_external=External 8 MHz
can128.menu.clock.8MHz_external.upload.default_speed=57600
can128.menu.clock.8MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.8MHz_external.build.clkpr=
can128.menu.clock.8MHz_external.build.f_cpu=8000000L

can128.menu.clock.7_3728MHz_external=External 7.3728 MHz
can128.menu.clock.7_3728MHz_external.upload.default_speed=115200
can128.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xfd
can128.menu.clock.7_3728MHz_external.build.clkpr=
can128.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

can128.menu.clock.6MHz_external=External 6 MHz
can128.menu.clock.6MHz_external.upload.default_speed=57600
can128.menu.clock.6MHz_external.bootloader.low_fuses=0xfd
can128.menu.clock.6MHz_external.build.clkpr=
can128.menu.clock.6MHz_external.build.f_cpu=6000000L

